#ifndef _SPORT_H
#define _SPORT_H

#include "globdefs.h"


/* Инит. SPORT0 как в режиме SPI */
void SPORT0_config(void);
u8   SPORT0_write_read(u8);


/*********************************************************************************** 
 * Разрешить приемник и передатчик - включаются всегда перед передачей в експандер
 ***********************************************************************************/
#pragma always_inline
IDEF void SPORT0_enable(void)
{
  *pSPORT0_TCR1 |= TSPEN; /* Передатчик */
  *pSPORT0_RCR1 |= RSPEN; /* Приемник */
   asm("ssync;");
}


/*********************************************************************************** 
 * Запретить приемник и передатчик - выключаются всегда после передачи в експандер
 ***********************************************************************************/
#pragma always_inline
IDEF void SPORT0_disable(void)
{
  *pSPORT0_TCR1 &= ~TSPEN; /* Передатчик */
  *pSPORT0_RCR1 &= ~RSPEN; /* Приемник */
   asm("ssync;");
}


#endif /* sport.h */
